import pandas as pd
from collections import defaultdict
import io

file = "Dand_Prakriya.xlsx"
xl = pd.ExcelFile(file)
df = xl.parse('Sheet')
secondCol = df.as_matrix()

hindi = []
for item in secondCol[0:,1]:
    hindi.append(item)
    
new_dict = defaultdict(int)
char_to_remove = ["1","2","3","4","5","6","7","8","9","0",
                  ",","-","|",":",";","a","b","c","d","e",
                  "f","g","h","i","j","k","l","m","n","o",
                  "p","q","r","s","t","u","v","w","x","y",
                  "z","(","}","]","?","'",'"',"*","+","_",")",
                  ".","[","{","A","B","C","D","E","F","G",
                  "H","I","J","K","L","M","O","P","Q","R",
                  "S","T","U","V","W","X","Y","Z"]
for item in hindi:
    temp = item.split()
    for i in temp:
        flag = False
        for x in char_to_remove:
            if(x in i):
                flag = True
                break
        if(flag == False):
            new_dict[i] += 1

stopwordsInHindi = ["अंदर","अत","अदि","अप","अपना","अपनि","अपनी","अपने",
                    "अभि","अभी","आदि","आप","इंहिं","इंहें","इंहों","इतयादि",
                    "इत्यादि","इन","इनका","इन्हीं","इन्हें","इन्हों","इस","इसका",
                    "इसकि","इसकी","इसके","इसमें","इसि","इसी","इसे","उंहिं",
                    "उंहें","उंहों","उन","उनका","उनकि","उनकी","उनके","उनको",
                    "उन्हीं","उन्हें","उन्हों","उस","उसके","उसि","उसी","उसे","एक",
                    "एवं","एस","एसे","ऐसे","ओर","और","कइ","कई","कर","करता",
                    "करते","करना","करने","करें","कहते","कहा","का","काफि",
                    "काफ़ी","कि","किंहें","किंहों","कितना","किन्हें","किन्हों","किया",
                    "किर","किस","किसि","किसी","किसे","की","कुछ","कुल","के",
                    "को","कोइ","कोई","कोन","कोनसा","कौन","कौनसा","गया",
                    "घर","जब","जहाँ","जहां","जा","जिंहें","जिंहों","जितना","जिधर",
                    "जिन","जिन्हें","जिन्हों","जिस","जिसे","जीधर","जेसा","जेसे",
                    "जैसा","जैसे","जो","तक","तब","तरह","तिंहें","तिंहों","तिन",
                    "तिन्हें","तिन्हों","तिस","तिसे","तो","था","थि","थी","थे","दबारा",
                    "दवारा","दिया","दुसरा","दुसरे","दूसरे","दो","द्वारा","न","नहिं",
                    "नहीं","ना","निचे","निहायत","नीचे","ने","पर","पहले","पुरा",
                    "पूरा","पे","फिर","बनि","बनी","बहि","बही","बहुत","बाद",
                    "बाला","बिलकुल","भि","भितर","भी","भीतर","मगर","मानो",
                    "मे","में","यदि","यह","यहाँ","यहां","यहि","यही","या","यिह",
                    "ये","रखें","रवासा","रहा","रहे","ऱ्वासा","लिए","लिये","लेकिन",
                    "व","वगेरह","वरग","वर्ग","वह","वहाँ","वहां","वहिं","वहीं",
                    "वाले","वुह","वे","वग़ैरह","संग","सकता","सकते","सबसे","सभि",
                    "सभी","साथ","साबुत","साभ","सारा","से","सो","हि","ही","हुअ",
                    "हुआ","हुइ","हुई","हुए","हे","हें","है","हैं","हो","होता","होति",
                    "होती","होते","होना","होने"]
for sw in stopwordsInHindi:
    if sw in new_dict:
        del new_dict[sw]
        
encoding = 'utf8'
with io.open("hindi_tokens.txt", 'w', encoding=encoding) as f:
    for words in sorted(new_dict.keys()):
        f.write(str(words))
        f.write(" - ")
        f.write(str(new_dict[words]))
        f.write("\n")
